In [60]:
import pandas as pd
import numpy as np
import datetime
from tqdm import tqdm

PATH = "data\\wallet_urfu.parquet.gzip"
RFM_PATH = "data\\rfm.parquet.gzip"

In [2]:
data = pd.read_parquet(PATH)

In [3]:
data.head()

   partner    rep_date      monetary
0   468726  2016-01-02  2.673749e-11
1   134145  2016-01-02  1.069500e-12
2    66774  2016-01-02  2.228576e-12
3   178928  2016-01-02  8.730611e-11
4   679693  2016-01-02  3.492244e-11

In [42]:
last_two_months = data[data['rep_date']>=datetime.date(2022, 12, 23)]
other = data[data['rep_date']<datetime.date(2022, 12, 23)]

In [43]:
grouped = other.groupby('partner').max()

In [54]:
data[data['partner']==3]

          partner    rep_date      monetary
1223635         3  2016-04-01  1.985107e-27
2711210         3  2016-07-01  3.273979e-08
9245757         3  2017-08-04  3.604379e-08
18931117        3  2019-01-29  2.849265e-08
42268138        3  2022-03-11  1.330801e-09
42986569        3  2022-04-12  1.742465e-09
45260212        3  2022-07-13  1.283296e-09

In [44]:
old_trans = grouped[grouped['rep_date']<datetime.date(2022, 11, 23)]

In [70]:
len(last_two_months)

1262795

In [68]:
count = 0
for partner in tqdm(old_trans.index):
    if partner in last_two_months:
        count += 1

count

100%|██████████| 1262795/1262795 [02:25<00:00, 8671.36it/s]

91579

In [46]:
other

          partner    rep_date      monetary
0          468726  2016-01-02  2.673749e-11
1          134145  2016-01-02  1.069500e-12
2           66774  2016-01-02  2.228576e-12
3          178928  2016-01-02  8.730611e-11
4          679693  2016-01-02  3.492244e-11
...           ...         ...           ...
49947837   407047  2022-12-22  2.298049e-12
49947838   155081  2022-12-22  6.547958e-11
49947839   459632  2022-12-22  2.182653e-12
49947840   821241  2022-12-22  1.623588e-12
49947841  1343539  2022-12-22  1.213985e-11

[49947842 rows x 3 columns]

           rep_date      monetary
partner
4        2022-12-26  6.308761e-12
22       2022-12-28  6.547958e-11
29       2023-01-13  8.730611e-12
49       2023-01-04  4.365305e-12
68       2023-01-16  1.309592e-09
...             ...           ...
1689641  2023-01-22  2.542790e-11
1689820  2023-01-22  5.238366e-12
1690232  2023-01-21  7.215391e-10
1690366  2023-01-22  6.329693e-14
1690436  2023-01-22  1.986214e-11

[65833 rows x 2 columns]